{"id":1544,"date":"2017-09-22T03:11:16","date_gmt":"2017-09-22T03:11:16","guid":{"rendered":"https:\/\/dev.chengdds.com\/?p=1544"},"modified":"2017-09-25T07:14:09","modified_gmt":"2017-09-25T07:14:09","slug":"importance-oral-health-total-overall-health","status":"publish","type":"post","link":"https:\/\/dev.chengdds.com\/importance-oral-health-total-overall-health","title":{"rendered":"The Importance Of Oral Health To Total Overall Health"},"content":{"rendered":"<p>One of the most essential services that we as dental health professionals provide is based on the fact that you cannot have good overall health without good oral health. Oral health and general physical health are inextricably linked, which means that it’s just as important to take care of your mouth, your teeth, and your overall oral health as it is to take care of the rest of your body.<\/p>\n<p>What should you watch out for to ensure your mouth is as healthy as possible? Prevention of the two most common culprits of poor oral health is the answer: caries (cavities and tooth decay) and periodontal (gum) disease.<\/p>\n<h2>Cavities<\/h2>\n<p>Getting a cavity is not just about the sweets or neglect of flossing. It’s about your mouth’s pH level and bacterial management.<\/p>\n<p>The bacteria in your mouth—both good and bad—live in a housing structure called biofilm. This provides the bacteria protection, food, and an ideal replicating environment. Biofilm can be healthy if there’s a balance of good bacteria, but an increase in bad bacteria can lead to plaque, tartar, and eventually tooth decay.<\/p>\n<p>How does bad bacteria flourish? It’s all in the pH. Foods and beverages have various pH levels. The lower the number, the higher the acidity.<\/p>\n<p>Since acid feeds bad bacteria, a beverage like soda will promote an environment in which a cavity is more likely to form. Water, since it is neutral, is a solid choice for promoting healthy oral pH.<br \/>\nMaintaining a balance of healthy bacteria and ideal pH levels starts at home with good oral hygiene, and can be extended by regular cleanings and checkups at our office.<\/p>\n<h2>Gum Disease<\/h2>\n<p>Gum disease, also known as periodontal disease, is a chronic bacterial infection of the gums, periodontal tissue, and bone that surround and support your teeth. Gum disease consists of gingivitis (the early stage of gum disease) and periodontitis (a more advanced stage of the disease).<\/p>\n<p>Gum disease occurs when bacteria erode the gum tissue and bone that support the teeth. The gums eventually pull away from the teeth, and infected pockets form. If left untreated, periodontitis will spread and lead to irreversible damage to your mouth, including the potential loss of teeth.<\/p>\n<p>Good home hygiene and regular visits to our office for professional cleanings and exams are the best ways to prevent gum disease.<\/p>\n<p>Copyright© 2016 Sesame Communications<\/p>\n","protected":false},"excerpt":{"rendered":"<p>One of the most essential services that we as dental health professionals provide is based on the fact that you cannot have good overall health without good oral health. Oral health and general physical health are inextricably linked, which means that it’s just as important to take care of your mouth, your teeth, and your&#8230;<\/p>\n","protected":false},"author":1,"featured_media":1546,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[31],"tags":[],"_links":{"self":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts\/1544"}],"collection":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/comments?post=1544"}],"version-history":[{"count":1,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts\/1544\/revisions"}],"predecessor-version":[{"id":1551,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts\/1544\/revisions\/1551"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/media\/1546"}],"wp:attachment":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/media?parent=1544"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/categories?post=1544"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/tags?post=1544"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}