{"id":1552,"date":"2017-09-26T03:02:36","date_gmt":"2017-09-26T03:02:36","guid":{"rendered":"https:\/\/dev.chengdds.com\/?p=1552"},"modified":"2017-09-26T03:02:36","modified_gmt":"2017-09-26T03:02:36","slug":"go-eats-clean-teeth","status":"publish","type":"post","link":"https:\/\/dev.chengdds.com\/go-eats-clean-teeth","title":{"rendered":"On-the-go Eats for Clean Teeth"},"content":{"rendered":"<p>Did you know that certain foods, when eaten, will help to keep your teeth clean? They are known as “detergent foods.” Think of them as the closest you can get to brushing your teeth, especially if you’re on the go and can’t actually brush for a while.<\/p>\n<p>Ideally, detergent foods should be the last items you consume during a meal for the best results. A healthy diet is vital for oral health as well as your overall physical health, but here are some special foods that can help keep your teeth and mouth clean and healthy:<\/p>\n<ul>\n<li>Carrots<\/li>\n<li>Apples<\/li>\n<li>Celery sticks<\/li>\n<li>Cucumbers<\/li>\n<li>Pears<\/li>\n<li>Lettuce<\/li>\n<li>Cheese<\/li>\n<\/ul>\n<p>It’s easy to see that most of these are firm and crisp. Biting into them exerts a “scrubbing” action on your teeth and gums. Cheese, on the other hand, helps to return the pH in your mouth to 7.0, which is the balance between acidic and basic.<\/p>\n<h2>Foods to Avoid<\/h2>\n<p>You should avoid foods full of carbohydrates (sugar), which feed the bacteria in your mouth and thereby create an acidic environment, which in turn increases the chance of cavities and decay. Cookies, cakes, breads, crackers, and soft drinks are among the worst offenders. Sticky candy and dried fruits tend to cling to your teeth and encourage the growth of bacteria as well.<\/p>\n<p>When you eat is almost as important as what you eat. Take drinking soda, for example. If you drink it all in one sitting instead of sipping it throughout the day, your saliva can do its job and neutralize your mouth’s pH.<\/p>\n<p>Sugar that is consumed throughout the day creates the perfect environment in your mouth for bacteria to flourish.<\/p>\n<h2>Using Detergent Foods<\/h2>\n<p>If you know you won’t be able to brush after a meal, save an apple, celery, or carrot sticks to eat at the very end. This will act as your “natural toothbrush” until you are able to brush and floss your teeth properly. It’s also a good idea to incorporate these foods as snacks throughout the day.<\/p>\n<p>Don’t forget, however, that these foods are not a replacement for brushing, flossing, and regular cleanings at our office. You still need good dental hygiene regardless of what you eat!<\/p>\n<p>Copyright© 2016 Sesame Communications<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Did you know that certain foods, when eaten, will help to keep your teeth clean? They are known as “detergent foods.” Think of them as the closest you can get to brushing your teeth, especially if you’re on the go and can’t actually brush for a while. Ideally, detergent foods should be the last items&#8230;<\/p>\n","protected":false},"author":1,"featured_media":1553,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[31],"tags":[],"_links":{"self":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts\/1552"}],"collection":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/comments?post=1552"}],"version-history":[{"count":1,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts\/1552\/revisions"}],"predecessor-version":[{"id":1554,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts\/1552\/revisions\/1554"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/media\/1553"}],"wp:attachment":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/media?parent=1552"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/categories?post=1552"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/tags?post=1552"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}