{"id":1584,"date":"2017-10-14T00:59:22","date_gmt":"2017-10-14T00:59:22","guid":{"rendered":"https:\/\/dev.chengdds.com\/?p=1584"},"modified":"2017-10-14T00:59:22","modified_gmt":"2017-10-14T00:59:22","slug":"five-chamblee-ga-restaurants-rank-near-top","status":"publish","type":"post","link":"https:\/\/dev.chengdds.com\/five-chamblee-ga-restaurants-rank-near-top","title":{"rendered":"Five Chamblee GA Restaurants That Rank Near The Top"},"content":{"rendered":"<p>You know the city of Chamblee is close to Atlanta when the #1 ranked restaurant on a top travel site for the small city is actually located in the capital city. Let&#8217;s skip over the Atlanta restaurants, however, that have landed a spot on the Chamblee restaurant rankings. There are 52 listed restaurants currently in the <a href=\"https:\/\/www.google.com\/maps?cid=13519322247265689609&amp;hl=en&amp;_ga=2.169834088.811278123.1507942450-2006899428.1505786152\">city of Chamblee, Georgia<\/a>. We are going to look at the top five.<\/p>\n<p>Food Terminal is one of those top five restaurants in Chamblee, and it can be found on Buford Highway NE. Food Terminal is a really nice establishment that serves up Asian cuisine. It is the top restaurant out of the 52 in Chamblee, so you can imagine the place gets rather busy. People mention in the reviews that the service is great, and one of the menu favorites is six hour braised beef. Doesn&#8217;t that sound like it would melt in your mouth?<\/p>\n<p>Hopstix is the next top ranked restaurant in Chamblee, and it is known for its delicious Japanese cuisine. Hopstix is on Pierce Drive, and you can enjoy sliders, king crab, sushi and much more. Corn Dogs even make the highlights, so they must be very tasty. Hey, I like corn dogs, too, but you don&#8217;t necessarily expect them to be on the menu highlights of a top ranked restaurant.<\/p>\n<p>Next up is Southbound, and it is a unique brunch spot on Peachtree Road. One of the cool things I noticed on the menu highlights for this place is a funnel cake. They also serve up short ribs, green eggs and ham and much more. I&#8217;m not sure about the green eggs and ham, but the rest sounds good. If you want breakfast, it seems like this might be your go to spot. It&#8217;s of course a great spot for lunch, too.<\/p>\n<p>Vintage Pizzeria is the fourth restaurant for this list, and it is located on Peachtree Road like Southbound. This establishment doesn&#8217;t just serve up pizza, but is known for delicious Italian food in general. The portions are also said to be quite large. Are you craving some Italian food? If so, this is your spot in Chamblee.<\/p>\n<p>What do you think the last restaurant is going to be? It is another Italian restaurant believe it or not, and so you have two great stops for food in that category. The Mad Italian is located on Savoy Drive, and one of the menu highlights jumped out at me. It is a cheese steak, which I&#8217;m not used to seeing on the menu for an Italian restaurant. Not only did it make the menu highlights for this establishment, but it also made the menu highlights for Vintage Pizzeria.<\/p>\n<p>You have five great spots to get some food in Chamblee, Georgia. One of them is a great spot for breakfast and lunch to get your day started. The other four can be enjoyed at your leisure as you take your time exploring the city of Chamblee GA and all the things to do there.<\/p>\n<p><iframe src=\"https:\/\/www.google.com\/maps\/embed?pb=!1m28!1m12!1m3!1d26492.887050729532!2d-84.30663554262601!3d33.89967403220127!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!4m13!3e6!4m5!1s0x88f509a2dee99dcf%3A0xa2e40dbdcbaf02dd!2sPlantation+Ln%2C+Georgia+30341!3m2!1d33.9078693!2d-84.3026069!4m5!1s0x88f509cb3f7518b3%3A0xbb9e47f4984ea009!2sYi-Tsu+Cheng%2C+D.D.S.+%26+Associates%2C+5008+Buford+Hwy+NE+Ste.+B%2C+Chamblee%2C+GA+30341!3m2!1d33.888563!2d-84.2870739!5e0!3m2!1sen!2s!4v1507942743249\" width=\"400\" height=\"300\" frameborder=\"0\" style=\"border:0\" allowfullscreen><\/iframe><\/p>\n","protected":false},"excerpt":{"rendered":"<p>You know the city of Chamblee is close to Atlanta when the #1 ranked restaurant on a top travel site for the small city is actually located in the capital city. Let&#8217;s skip over the Atlanta restaurants, however, that have landed a spot on the Chamblee restaurant rankings. There are 52 listed restaurants currently in&#8230;<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts\/1584"}],"collection":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/comments?post=1584"}],"version-history":[{"count":1,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts\/1584\/revisions"}],"predecessor-version":[{"id":1585,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts\/1584\/revisions\/1585"}],"wp:attachment":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/media?parent=1584"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/categories?post=1584"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/tags?post=1584"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}