{"id":1592,"date":"2017-10-14T01:11:46","date_gmt":"2017-10-14T01:11:46","guid":{"rendered":"https:\/\/dev.chengdds.com\/?p=1592"},"modified":"2017-10-14T01:11:46","modified_gmt":"2017-10-14T01:11:46","slug":"travel-guide-antique-row-chamblee-ga","status":"publish","type":"post","link":"https:\/\/dev.chengdds.com\/travel-guide-antique-row-chamblee-ga","title":{"rendered":"Your Travel Guide To Antique Row And More In Chamblee GA"},"content":{"rendered":"<p>You are really going to enjoy this <a href=\"https:\/\/www.google.com\/maps\/place\/Yi-Tsu+Cheng,+D.D.S.+%26+Associates\/@33.8885674,-84.2892626,17z\/data=!3m1!4b1!4m5!3m4!1s0x88f509cb3f7518b3:0xbb9e47f4984ea009!8m2!3d33.888563!4d-84.2870739?hl=en\">travel guide for Chamblee GA<\/a>. There are some really unique places of interest, and I explored some of them with you in a past article about three of the top things to do when you visit Chamblee. I am going to give those three attractions a mention, and then I am going to give you details about all the other great attractions that await you in Chamblee, Georgia. <\/p>\n<p>The three attractions that have already been reviewed for you in a past article are the Buford Highway Flea Market, Plaza Fiesta, and the Antique Factory. I mentioned as well that there is Antique Row, and that is where we are headed. The Antique Factory is part of Antique Row as you can imagine, and this next attraction is, too. It is called The Atlanta Antique Gallery, and it is located on Broad Street. <\/p>\n<p>Just because it is called The Atlanta Antique Gallery doesn&#8217;t mean it is located in Atlanta of course. Chamblee GA is in the Atlanta metro area. One thing you sometimes have to worry about when it comes to antique shops is prices. Prices can certainly be a little high, but at this shop or mall I should say, reviewers report that prices are reasonable. <\/p>\n<p>Broad Street Antique Mall is another stop along Antique Row. People say this place features a nice variety of items, and so it&#8217;s a definite stop if you are in the mood for antiquing. I&#8217;m assuming that is the reason you picked to travel Chamblee because antiques and flea market shops are the culture there. Some of the places of interest outside of Antique Row also bring you culture from other parts of the world.<\/p>\n<p>Way Back When Antiques &#038; Collectibles is another top pick, and it is actually on Peachtree Road and not Broad Street. This place is said to be very small; however, reviews say that it is worth the pit stop. Are you planning on making a pit stop at all of the antique stores? There are certainly more of them. <\/p>\n<p>Chamblee Antiques &#038; Collectibles is the next featured place of interest. How do you like this travel guide so far? Chamblee Antiques &#038; Collectibles is located on Broad Street with the others, and don&#8217;t confused it with Chamblee Antiques &#038; Interiors. They are two different businesses, and maybe you will want to stop by both of them.<\/p>\n<p>The Way We Were Antiques is another top choice. You just need to hope that by the time you get done shopping you have space to sit down in your vehicle. All of these antique shops are going to be fun, and I bet you  are already thinking about what you might find. Truly, you just never know, and it&#8217;s not always the largest collections that are the best, just remember that. This is one of those vacations where you definitely plan to bring home some great souvenirs, and watch out because some of them might be quite large.<\/p>\n<p><iframe src=\"https:\/\/www.google.com\/maps\/embed?pb=!1m28!1m12!1m3!1d52983.81801905949!2d-84.28328939966939!3d33.90282168505371!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!4m13!3e6!4m5!1s0x88f5a6cebdef9567%3A0xbb58196ef84d2840!2sCountry+Inn+%26+Suites+By+Carlson%2C+Norcross%2C+GA%2C+5970+Jimmy+Carter+Blvd%2C+Norcross%2C+GA+30071!3m2!1d33.9220375!2d-84.2132508!4m5!1s0x88f509cb3f7518b3%3A0xbb9e47f4984ea009!2sYi-Tsu+Cheng%2C+D.D.S.+%26+Associates%2C+Buford+Highway+Northeast+Ste.+B%2C+Chamblee%2C+GA%2C+%E7%BE%8E%E5%9C%8B!3m2!1d33.888563!2d-84.2870739!5e0!3m2!1sen!2s!4v1507943494147\" width=\"600\" height=\"450\" frameborder=\"0\" style=\"border:0\" allowfullscreen><\/iframe><\/p>\n","protected":false},"excerpt":{"rendered":"<p>You are really going to enjoy this travel guide for Chamblee GA. There are some really unique places of interest, and I explored some of them with you in a past article about three of the top things to do when you visit Chamblee. I am going to give those three attractions a mention, and&#8230;<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts\/1592"}],"collection":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/comments?post=1592"}],"version-history":[{"count":1,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts\/1592\/revisions"}],"predecessor-version":[{"id":1593,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts\/1592\/revisions\/1593"}],"wp:attachment":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/media?parent=1592"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/categories?post=1592"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/tags?post=1592"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}