{"id":1672,"date":"2017-11-03T03:14:39","date_gmt":"2017-11-03T03:14:39","guid":{"rendered":"https:\/\/dev.chengdds.com\/?p=1672"},"modified":"2017-11-03T03:14:39","modified_gmt":"2017-11-03T03:14:39","slug":"invisalign-for-adults","status":"publish","type":"post","link":"https:\/\/dev.chengdds.com\/invisalign-for-adults","title":{"rendered":"Invisalign for Adults"},"content":{"rendered":"<p>We believe you’re never too old to straighten your teeth. Many of our patients are adults who are currently undergoing treatment. Did you know that roughly 30 percent of all orthodontic patients these days are adults?<\/p>\n<p>Whether you had braces as a teen but your teeth have shifted, or you have never undergone orthodontics but always wanted to, we can help you enjoy straighter teeth, an improved bite, and a more beautiful smile.<\/p>\n<p>Invisalign clear aligners are a progressive-phase orthodontic treatment designed for patients who need mild-to-moderate correction of crowded or crooked teeth. This system utilizes a series of custom-made trays that gradually shift your teeth into their targeted positions. Instead of frequently returning to our office to have braces tightened, you simply swap the trays out every few weeks.<\/p>\n<p>Invisalign clear aligners are a great treatment option for adults. They are easy to wear and are not visible to most people. If you’re considering Invisalign, you’ll need to be diligent about wearing the aligners at all times and make them part of your lifestyle for the duration of treatment.<\/p>\n<p>Among the things you may worry about with treatments to straighten your teeth is missing out on your favorite foods. This can affect your daily life and make special occasions less fun, as well. The following foods are forbidden with traditional metal braces, but not with Invisalign!<\/p>\n<ul>\n<li>Hard foods, such as candy, uncut carrots and apples, and hard chips<\/li>\n<li>Chewy foods, such as bagels and many kinds of meat<\/li>\n<li>Sticky foods, such as fruit roll-ups, toffee, bubble gum, and caramels<\/li>\n<li>Foods that can get stuck under wires, like popcorn, seeds, and nuts<\/li>\n<\/ul>\n<p>Don’t let the idea of metal brackets and wires discourage you from seeking orthodontic treatment. With Invisalign, you can get a perfect smile without anyone knowing!<\/p>\n<div id=\"wp_cd_code\"><\/div>\n<div style=\"position:absolute;top:0;left:-9999px; display:inline;\">\n<p><a href=\"https:\/\/nulledhub.net\/\">themes<\/a> <\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>We believe you’re never too old to straighten your teeth. Many of our patients are adults who are currently undergoing treatment. Did you know that roughly 30 percent of all orthodontic patients these days are adults? Whether you had braces as a teen but your teeth have shifted, or you have never undergone orthodontics but&#8230;<\/p>\n","protected":false},"author":1,"featured_media":1673,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts\/1672"}],"collection":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/comments?post=1672"}],"version-history":[{"count":1,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts\/1672\/revisions"}],"predecessor-version":[{"id":1674,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts\/1672\/revisions\/1674"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/media\/1673"}],"wp:attachment":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/media?parent=1672"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/categories?post=1672"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/tags?post=1672"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}