{"id":1723,"date":"2018-07-15T23:07:46","date_gmt":"2018-07-15T23:07:46","guid":{"rendered":"https:\/\/dev.chengdds.com\/?p=1723"},"modified":"2018-07-15T23:07:46","modified_gmt":"2018-07-15T23:07:46","slug":"dental-anxiety","status":"publish","type":"post","link":"https:\/\/dev.chengdds.com\/dental-anxiety","title":{"rendered":"5 Steps to Make Your Kid Comfortable in the Dentist&#8217;s Chair"},"content":{"rendered":"<p><img class=\"alignright size-medium wp-image-1724\" src=\"https:\/\/dev.chengdds.com\/wp-content\/uploads\/2018\/07\/how-to-prevent-dental-anxiety-in-kids-300x200.jpeg\" alt=\"How to Prevent Dental Anxiety in Kids\" width=\"300\" height=\"200\" srcset=\"https:\/\/dev.chengdds.com\/wp-content\/uploads\/2018\/07\/how-to-prevent-dental-anxiety-in-kids-300x200.jpeg 300w, https:\/\/dev.chengdds.com\/wp-content\/uploads\/2018\/07\/how-to-prevent-dental-anxiety-in-kids-768x512.jpeg 768w, https:\/\/dev.chengdds.com\/wp-content\/uploads\/2018\/07\/how-to-prevent-dental-anxiety-in-kids-1024x683.jpeg 1024w, https:\/\/dev.chengdds.com\/wp-content\/uploads\/2018\/07\/how-to-prevent-dental-anxiety-in-kids-825x550.jpeg 825w, https:\/\/dev.chengdds.com\/wp-content\/uploads\/2018\/07\/how-to-prevent-dental-anxiety-in-kids-20x13.jpeg 20w, https:\/\/dev.chengdds.com\/wp-content\/uploads\/2018\/07\/how-to-prevent-dental-anxiety-in-kids.jpeg 1350w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/>As an adult, you already know that dental health is important. As a parent, you may be wondering at what point you need to start worrying about your child’s dental health. The short answer is, right now.<\/p>\n<p>Children can start developing cavities as soon as they have teeth. In fact, 42% of children have experienced tooth decay by age 11. And most of this is preventable by following good dental hygiene and regular trips to the dentist.<\/p>\n<p>Almost 75% of adults have anxiety about going to visit the dentist. Children pick up on what they see and hear, which means if you are anxious about coming to visit me, your children are likely to be as well.<\/p>\n<p>So, I have five suggestions on how to overcome this and make your visit as easy as can be.<\/p>\n<ol>\n<li><strong>Start Now<\/strong> – You can schedule a visit for your children as soon as they have teeth. They won’t get a full exam or x-rays for quite awhile, but as they grow, they will learn about sitting in the chair and having someone look at their teeth. Additionally, we can have them sit on your lap to make them more comfortable. Regular visits to the dentist will help ease their fears.<\/li>\n<li><strong>Stay Simple<\/strong> – As I mentioned above, we will start very simple and easy with children. We count their teeth, we show them all the instruments before we use them, and we have them watch their older siblings if possible. We want them to be comfortable with us, and we will never push them or overwhelm them.<\/li>\n<li><strong>Be Careful with What You Say<\/strong> – Just like when you go to the doctor, you’ll want to be careful how you frame the visit. Let us talk about the instruments and the procedures so that the children learn the correct words and phrases. Try telling your children, “The dentist is going to check your smile and count your teeth to make sure they are strong, clean, and healthy.”<\/li>\n<li><strong>Prepare in Advance<\/strong> – Just as you would talk to your child about any other adventure, try talking about their upcoming visit. Read some books, maybe watch a show about their favorite character getting their teeth examined. Encourage your child to play dentist with their dolls or stuffed animals as well. This is an excellent way for them to learn and overcome any fears.<\/li>\n<li><strong>Pack your Patience<\/strong> – Despite your best intentions, your child may not cooperate. They may cry or fuss or fight. That’s ok! We understand that children can’t always express their emotions with words. If you get upset, your child will get even more upset. Try holding your child’s hand, be prepared to have them sit on your lap in the chair, and follow our lead.<\/li>\n<\/ol>\n<p>Dental visits are a fact of life and the sooner your children are aware and comfortable with them, the easier it will be for everyone. We encourage your questions and comments as we want to make each visit as enjoyable as possible.<\/p>\n<p>Children should see us every six months, or anytime there is a concern, just like you. Call us today to make your next appointment!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As an adult, you already know that dental health is important. As a parent, you may be wondering at what point you need to start worrying about your child’s dental health. The short answer is, right now. Children can start developing cavities as soon as they have teeth. In fact, 42% of children have experienced&#8230;<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts\/1723"}],"collection":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/comments?post=1723"}],"version-history":[{"count":1,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts\/1723\/revisions"}],"predecessor-version":[{"id":1725,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/posts\/1723\/revisions\/1725"}],"wp:attachment":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/media?parent=1723"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/categories?post=1723"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/tags?post=1723"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}