{"id":1864,"date":"2019-01-19T19:58:20","date_gmt":"2019-01-19T19:58:20","guid":{"rendered":"https:\/\/dev.chengdds.com\/?page_id=1864"},"modified":"2019-01-19T20:18:36","modified_gmt":"2019-01-19T20:18:36","slug":"post-treatment-instructions","status":"publish","type":"page","link":"https:\/\/dev.chengdds.com\/post-treatment-instructions","title":{"rendered":"Post-Treatment Instructions"},"content":{"rendered":"<p>[vc_row css=&#8221;.vc_custom_1441619155187{margin-bottom: 50px !important;}&#8221;][vc_column offset=&#8221;vc_hidden-xs&#8221;][vc_column_text]<\/p>\n<h1 id=\"top\">Post-Treatment Instructions<\/h1>\n<ul>\n<li><a href=\"#tooth-extraction\">After Tooth Extraction<\/a><\/li>\n<li><a href=\"#root-canal\">After Root Canal Therapy<\/a><\/li>\n<li><a href=\"#periodontal-surgery\">After Periodontal Surgery<\/a><\/li>\n<li><a href=\"#tooth-fillings\">After Fillings<\/a><\/li>\n<li><a href=\"#crown-bridge\">After Crown and Bridge Appointments<\/a><\/li>\n<li><a href=\"#cosmetic-reconstruction\">After Cosmetic Reconstruction<\/a><\/li>\n<li><a href=\"#deep-cleaning\">After Scaling &#038; Root Planning (Deep Cleaning)<\/a><\/li>\n<\/ul>\n<p>[\/vc_column_text][vc_separator][vc_column_text]<\/p>\n<h2 id=\"tooth-extraction\">After Tooth Extraction<\/h2>\n<p class=\"p1\"><span class=\"s1\">After an extraction, it’s important for a blood clot to form to stop the bleeding and begin the healing process. That’s why we ask you to bite on a gauze pad for 30 to 45 minutes after the extraction. If bleeding or oozing continues after you remove the gauze pad, place another gauze pad and bite firmly for another thirty minutes. You may have to do this several times.<\/span><\/p>\n<p>After the blood clot forms it is important to protect it especially for the next 24 hours. So Don’t: smoke, suck through a straw, rinse your mouth vigorously, or clean the teeth next to the extraction site.<\/p>\n<p>These activities will dislodge the clot and slow down healing. Limit yourself to calm activities for the first 24 hours, this keeps your blood pressure lower, reduces bleeding and helps healing process.<\/p>\n<p>After the tooth is extracted you may feel some pain and have some swelling. You can use an ice bag to keep this to a minimum. The swelling usually starts to go down after 48 hours.<\/p>\n<p>Use paid medication only as directed, call the office if it doesn’t seem to be working. If antibiotics are prescribed, continue to take them for the indicated length of time, even if all symptoms and signs of infection are gone. Drink lots of fluids and eat only soft nutritious foods on the day of the extraction. Don’t use alcoholic beverages and avoid hot and spicy foods. You can begin eating normally the next day or as soon as it is comfortable.<\/p>\n<p>Gently rinse your mouth with salt water three times a day beginning the day after the extraction (a tsp. of salt in a cup of warm water, rinse-swish-spit). Also, rinse gently after meals, it helps keep food out of the extraction site. It is very important to resume your normal dental routine after 24 hours, this should include brushing your teeth and tongue and flossing at least once a day. This speeds healing and helps keep your breath and mouth fresh.<\/p>\n<p>Call us right away if you have heavy bleeding, severe pain, continued swelling after two or three days, or a reaction to the medication. After a few days you will be feeling fine and can resume your normal activities.<\/p>\n<p><a href=\"#top\">Back to Top<\/a>[\/vc_column_text][vc_separator][vc_column_text]<\/p>\n<h2 id=\"root-canal\">After Root Canal Therapy<\/h2>\n<p class=\"p1\">Root canal therapy often takes two or more appointments to complete. A temporary filling or crown is placed to protect the tooth between appointments. After each appointment when anesthetic has been used, your lips, teeth and tongue may be numb for several hours after the appointment. Avoid any chewing until the numbness has completely worn off.<\/p>\n<p>Between appointments it is common (and not a problem) for a small portion of your temporary filling to wear away or break off. If the entire filling falls out, or if a temporary crown comes off, call us so that it can be replaced.<\/p>\n<p>It’s normal to experience some discomfort for several days after a root canal appointment, especially when chewing. To control discomfort, take pain medication as recommended. To further reduce pain and swelling, rinse three times a day with warm salt water (a tsp. Of salt in a cup of warm water, rinse-swish-spit).<\/p>\n<p>If antibiotics are prescribed, continue to take them as prescribed, even if all symptoms and signs of infection are gone. To protect the tooth and help keep your temporary in place, avoid eating sticky foods (especially gum), hard goods, and if possible, chew only on the opposite side of your mouth. It’s important to continue to brush and floss normally.<\/p>\n<p>Usually, the last step after root canal treatment is the placement of a crown on the tooth. A crown covers and protects the tooth from breaking in the future. If your bite feels uneven, if you have persistent swelling or pain, or you have any other questions or concerns, please call our office.<\/p>\n<p><a href=\"#top\">Back to Top<\/a>[\/vc_column_text][vc_separator][vc_column_text]<\/p>\n<h2 id=\"periodontal-surgery\">After Periodontal Surgery<\/h2>\n<p class=\"p1\">After your periodontal surgery, your lips, teeth and tongue may be numb for several hours. Avoid any chewing until the numbness has completely worn off. Don’t eat anything for two hours following surgery.<\/p>\n<p>It’s normal to experience some discomfort for several days after a surgery. To control discomfort, take pain medication as recommended. Do not take medication on an empty stomach or nausea may result. Apply an ice pack (20 minutes on, 20 minutes off) for six hours following surgery to decrease pain and swelling.<\/p>\n<p>After twenty-four hours, to further reduce pain and swelling, rinse three times a day with warm salt water (put a tsp. of salt in a cup of warm water, gently rinse-swish-spit). If antibiotics are prescribed, continue to take them for the indicated length of time, even if all symptoms and signs of infection are gone.<\/p>\n<p>Some slight bleeding is normal for a day or so following surgery. If bleeding persists, apply firm pressure with a moist gauze pad or bite on a tea bag for twenty minutes. Elevate your head with pillows. Call our office if this doesn’t control bleeding or if bleeding increases.<\/p>\n<p>For the first 48 hours, restrict your diet to soft foods such as yogurt, ice cream, cottage cheese, and soups until you can chew comfortably. Relax as much as possible and avoid all strenuous activities for the first twenty-four hours following surgery.<\/p>\n<p>Continue your normal home-care routine in the non-treated areas. You may gently rinse around the treated area with warm water or mouthwash, but frequent or vigorous rinsing must be avoided until healing has taken place. Call us if pain or swelling persists or if you have any questions or concerns.<\/p>\n<p><a href=\"#top\">Back to Top<\/a>[\/vc_column_text][vc_separator][vc_column_text]<\/p>\n<h2 id=\"tooth-fillings\">After Fillings<\/h2>\n<p class=\"p1\">When anesthetic has been used, your lips, teeth, and tongue may be numb for several hours after the appointment. Avoid any chewing until the numbness has completely worn off.<\/p>\n<p>It’s normal to experience some hot, cold and pressure sensitivity after your appointment. Your gums may be sore for several days. Rinse three times a day with warm salt water, (put a tsp. of salt in a cup of warm water, rinse-swish-spit) to reduce pain and swelling.<\/p>\n<p>You may chew normally on tooth colored fillings since they set completely on the day of your appointment. Don’t chew hard foods or chew directly on your new composite fillings for twenty-four hours. If possible, chew only on the opposite side of your mouth.<\/p>\n<p>If your bite feels uneven, if you have persistent pain, or if you have any other questions or concerns, please call our office.<\/p>\n<p><a href=\"#top\">Back to Top<\/a>[\/vc_column_text][vc_separator][vc_column_text]<\/p>\n<h2 id=\"crown-bridge\">After Crown and Bridge Appointments<\/h2>\n<p class=\"p1\">Crowns and bridges usually take two or three appointments to complete. On the first appointment the teeth are prepared. Temporary crowns or bridges are placed to protect the teeth while the custom restoration is being made. After each appointment when anesthetic has been used, your lips, teeth and tongue may be numb for several hours after the appointment. Avoid any chewing until the numbness has completely worn off.<\/p>\n<p>On rare occasions, temporary crowns come off. Call us if this happens and keep the temporary so we can re-cement it. It is very important for the proper fit of your final restoration that temporaries stay in place.<\/p>\n<p>It’s normal to experience some hot, cold, and pressure sensitivity after each appointment. Your gums may be sore for several days. Rinse three times a day with warm salt water (a tsp. of salt in a cup of warm water, rinse-swish-spit) to reduce pain and swelling. Use medication only as directed.<\/p>\n<p>To help keep your temporary in place, avoid eating sticky foods (especially gum), hard foods, and if possible, chew only on the opposite side of your mouth. It’s important to brush normally, but floss very carefully and remove the floss from the side to prevent removal of the temporary crown.<\/p>\n<p>If your bite feels uneven, if you have persistent pain, or you have any other questions or concerns, please call our office.<\/p>\n<p><a href=\"#top\">Back to Top<\/a>[\/vc_column_text][vc_separator][vc_column_text]<\/p>\n<h2 id=\"cosmetic-reconstruction\">After Cosmetic Reconstruction<\/h2>\n<p class=\"p1\">Remember that it will take time to adjust to the feel of your new bite. When the bite is altered or the position of the teeth is changed it takes several days for the “brain” to recognize the new position of your teeth or their thickness as normal. If you continue to detect any high spots or problems with your bite, call us so we can schedule an adjustment appointment.<\/p>\n<p>It’s normal to experience some hot, cold and pressure sensitivity. Removing tooth structure and placement of new materials may result in a period of adjustment. Your gums may also be sore for several days. Rinse three times a day with warm salt water (a tsp. of salt in a cup of warm water, rinse-swish-spit) to reduce pain and swelling. Mild pain medication should ease your discomfort during the adjustment period.<\/p>\n<p>Don’t be concerned if your speech is affected for the first few days. You’ll quickly adapt and be speaking normally. You may notice increased salivary flow. Your brain may respond to the new size and shape of your teeth by increasing salivary flow. This should subside to normal within a week or so.<\/p>\n<p>Daily plaque removal is critical for the long-term success of your dental work. Maintain a regular oral hygiene routine. Daily brushing and flossing is a must. Regular cleaning appointments in our office are also critically important. We’ll use the appropriate cleaning abrasives and techniques for your specific cosmetic work.<\/p>\n<p>It’s important to change habits to protect your new teeth. Any food that could chip, crack, or damage your natural teeth can do the same to your new cosmetic restorations. Avoid sticky candies, any unusually hard foods or substances (such as peanut brittle, fingernails, pencils or ice). Avoid or minimize your use of foods that stain, such as tea, coffee, red wine and berries. Smoking will quickly yellow your teeth.<\/p>\n<p>Let us know if you grind your teeth at night or engage in sports so we can make you a custom mouth-guard. Adjusting to the look and feel of your new smile will take time. If you have any problems or concerns, we always welcome your questions.<\/p>\n<p><a href=\"#top\">Back to Top<\/a>[\/vc_column_text][vc_separator][vc_column_text]<\/p>\n<h2 id=\"deep-cleaning\">After Scaling &amp; Root Planing (Deep Cleaning)<\/h2>\n<ol>\n<li class=\"p1\">When anesthetic has been used, your lips, teeth, tongue, and cheeks may be numb for several hours after the appointment. Avoid any chewing on the affected side until the numbness has completely worn off.<\/li>\n<li>Sensitivity to hot and cold foods may occur so avoid them if possible.<\/li>\n<li>Your gum may be sore for several days. Over the counter pain medication (Tylenol, Advil or whichever you would normally take for a headache) may be used. Rinse three times a day with Listerine mouthwash or warm salt water to promote healing (a tsp. of salt in a cup of warm water).<\/li>\n<li>If given Peridex mouthwash, use as directed. Gently rinse with ½ ounce twice daily (after breakfast and before bedtime) for two weeks. These mouthwash solutions may stain your teeth and may affect your sense of taste; however, these side effects are reversible and are usually not seen after discontinuation of use.<\/li>\n<li>Take medication(s) (antibiotics or analgesics) regularly as prescribed by your dentist. Avoid drinking alcohol, using heavy machinery, and driving while on the medication(s).<\/li>\n<li>Smoking delays healing. Please try not smoke following this procedure.<\/li>\n<li>Adequate nutrition is also essential following this procedure. Pick foods that are high in protein and drink plenty of fluid.<\/li>\n<li>Remember to brush twice a day, floss daily and follow up with your 3-month-recall appointments to promote and maintain healthy gums. Note: Healthy gums do not bleed.<\/li>\n<\/ol>\n<p>With your cooperation and effort, we will achieve the best result possible.<br \/>\nIf you have any questions or find any unusual circumstances, please contact our office.<\/p>\n<p><a href=\"#top\">Back to Top<\/a>[\/vc_column_text][\/vc_column][\/vc_row][vc_row full_width=&#8221;stretch_row&#8221; css=&#8221;.vc_custom_1442990745769{margin-bottom: 0px !important;}&#8221; el_class=&#8221;base_background_color&#8221;][vc_column][vc_cta h2=&#8221;&#8221; h4=&#8221;Have a question? Want to send us a quick line? Need to make an appointment?&#8221; shape=&#8221;square&#8221; style=&#8221;flat&#8221; color=&#8221;blue&#8221; add_button=&#8221;right&#8221; btn_title=&#8221;Contact Us Now&#8221; btn_style=&#8221;flat&#8221; btn_shape=&#8221;round&#8221; btn_color=&#8221;white&#8221; btn_link=&#8221;url:%2Fcontact-us||&#8221;][\/vc_cta][\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_row css=&#8221;.vc_custom_1441619155187{margin-bottom: 50px !important;}&#8221;][vc_column offset=&#8221;vc_hidden-xs&#8221;][vc_column_text] Post-Treatment Instructions After Tooth Extraction After Root Canal Therapy After Periodontal Surgery After Fillings After Crown and Bridge Appointments After Cosmetic Reconstruction After Scaling &#038; Root Planning (Deep Cleaning) [\/vc_column_text][vc_separator][vc_column_text] After Tooth Extraction After an extraction, it’s important for a blood clot to form to stop the bleeding and begin&#8230;<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/pages\/1864"}],"collection":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/comments?post=1864"}],"version-history":[{"count":15,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/pages\/1864\/revisions"}],"predecessor-version":[{"id":1922,"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/pages\/1864\/revisions\/1922"}],"wp:attachment":[{"href":"https:\/\/dev.chengdds.com\/wp-json\/wp\/v2\/media?parent=1864"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}